[
  {
    "url": "https://html5.gamemonetize.com/8j1yrpb0xpmufhojds2rloowa334q7ts/",
    "title": "Emotional Support Duck",
    "description": "Emotional Support Duck is a cozy life-management game where you balance your Emotional Energy and your duck&amp;rsquo;s Support Capacity. Face 100+ random events, enjoy soothing visuals and ambient audio, and track progress with autosaves and high scores on any device.",
    "thumbnail": "https://img.gamemonetize.com/8j1yrpb0xpmufhojds2rloowa334q7ts/512x384.jpg",
    "category": "Puzzles",
    "added_at": "2025-12-04T03:45:13.713071Z"
  },
  {
    "url": "https://html5.gamemonetize.com/i376ctj4firbz34cju00yyepssrvxco9/",
    "title": "ASMR Mini Puzzle Games 2024",
    "description": "Need a quick stress release? Weve got you covered with a variety of virtual popping games. Pop bubble wrap that never runs out, fidget with popping buttons that click oh-so-satisfyingly, and explore a world of colorful fidget toys that fit right in your pocket. Weve got a ton of cool antistress 3d fidget toys to pop and play with, plus awesome ASMR sounds for extra calming vibes. We even have balloon popping games for some extra fun. Its the perfect way to relax and de-stress.",
    "thumbnail": "https://img.gamemonetize.com/i376ctj4firbz34cju00yyepssrvxco9/512x384.jpg",
    "category": "Arcade",
    "added_at": "2025-12-04T03:45:13.713070Z"
  },
  {
    "url": "https://html5.gamemonetize.com/85n63q0psxqw26ojixem9459svfp46ld/",
    "title": "Easy Picture Colouring Game",
    "description": "Looking for coloring games for kids? Try our fun coloring for kids &amp;mdash; a perfect blend of creativity, learning, and kids coloring gameplay! Simply tap a picture from our coloring book for kids and choose how you want to color it: by numbers, by letters, or by solving simple math problems! Its an easy way for little boys and girls to be creative and learn while playing an engaging kids game.",
    "thumbnail": "https://img.gamemonetize.com/85n63q0psxqw26ojixem9459svfp46ld/512x384.jpg",
    "category": "Puzzles",
    "added_at": "2025-12-04T03:45:13.713068Z"
  },
  {
    "url": "https://html5.gamemonetize.com/o1770rkhfl4qeja9s68btv7flae5ooe7/",
    "title": "Labubu Find the Differences",
    "description": "Labubu Find the Differences is an amazing and free to play online game for kids. The aim of the game is to fin all 5 differences on each level to enter a new one. Labubu theme and a lot of fun is waiting for you!",
    "thumbnail": "https://img.gamemonetize.com/o1770rkhfl4qeja9s68btv7flae5ooe7/512x384.jpg",
    "category": "Puzzles",
    "added_at": "2025-12-04T03:45:13.713067Z"
  },
  {
    "url": "https://html5.gamemonetize.com/54o8e31n5pikjwkpbotk09ffg09eluy1/",
    "title": "Neon Pulse Arena",
    "description": "Neon Pulse Arena is a fast-reaction survival arcade game where you dodge incoming shapes and push your limits for as long as possible. Every second you survive, the arena becomes more intense. Simple controls, clean neon visuals, and pure skill-based gameplay &amp;mdash; no luck, just reflex. How long can you stay alive?",
    "thumbnail": "https://img.gamemonetize.com/54o8e31n5pikjwkpbotk09ffg09eluy1/512x384.jpg",
    "category": "Clicker",
    "added_at": "2025-12-04T03:45:13.713065Z"
  },
  {
    "url": "https://html5.gamemonetize.com/vzlf957tf696fqliepaa9gkcgd2omtx9/",
    "title": "Tower Breaker",
    "description": "Tower Breaker is a physics-based destruction game where you throw different types of projectiles, collapse towers, break structures, and experiment with realistic physics. Pull the rope, aim, and release &amp;mdash; each ball has unique properties and opens new ways to bring the entire city down.Spectacular destruction, falling debris, explosions, and endless chaos. Every level is different &amp;mdash; sturdy towers, fragile constructions, ultra-tall buildings, bonus structures, and even randomly generated cities.",
    "thumbnail": "https://img.gamemonetize.com/vzlf957tf696fqliepaa9gkcgd2omtx9/512x384.jpg",
    "category": "Shooting",
    "added_at": "2025-12-04T03:45:13.713064Z"
  },
  {
    "url": "https://html5.gamemonetize.com/18vy36scythopw8n2oibpaltoj3wvjwp/",
    "title": "Fruit Catchere",
    "description": "Get ready to experience the juicy fun of Fruit Catcher, a simple yet addictive game that will test your reflexes, timing, and hand-eye coordination! Step into the colorful world of fruits, where your only goal is to catch as many falling fruits as possible before they hit the ground. Sounds easy? Think again &amp;mdash; with every level, the speed increases, and the challenge gets even more exciting! Use your mouse (or finger on mobile) to move the basket. Catch fresh fruits like apples, oranges, bananas, and more. Avoid bad fruits or bombs that can ruin your streak.",
    "thumbnail": "https://img.gamemonetize.com/18vy36scythopw8n2oibpaltoj3wvjwp/512x384.jpg",
    "category": "Puzzles",
    "added_at": "2025-12-04T03:45:13.713062Z"
  },
  {
    "url": "https://html5.gamemonetize.com/874bx7nponra853hk8751z6ui4ssa07q/",
    "title": "City Car Pick And Drop Game",
    "description": "Welcome to the car pick and drop game. Get ready to experience the most realistic, thrilling, and immersive car driving adventure game. In this game you are not just driving, you are providing an essential service to virtual passengers who rely on your exceptional driving skills to reach their destinations safely. From the bustling city streets every journey tells a story, and every passenger adds a new layer of excitement and challenge to your day as a professional driver. In the car pick and drop game you play as a dedicated and skilled driver working for a modern, high-tech ride service.",
    "thumbnail": "https://img.gamemonetize.com/874bx7nponra853hk8751z6ui4ssa07q/512x384.jpg",
    "category": "Adventure",
    "added_at": "2025-12-04T03:45:13.713060Z"
  },
  {
    "url": "https://html5.gamemonetize.com/qbqv80h4e5r9avum225uy3hxqdxu5793/",
    "title": "Highway Car Racing Game",
    "description": "Enjoy the cutting edge 3D graphics with realistically created environments and amazingly detailed cars. Race at high speeds, drive against traffic and overtake cars! Dont push your luck in sticky situations, slow time for easier manoeuvres. Take a ride in Village, Desert, City, or have a snowy one in Winter. Feel the Fever in One Way and Two Way, rush a quick game in Time Attack or drive calmly in Free Ride. Race through traffic with Top or Back camera, or just dive into the action with Hood camera. Each camera angle offers a unique driving experience.",
    "thumbnail": "https://img.gamemonetize.com/qbqv80h4e5r9avum225uy3hxqdxu5793/512x384.jpg",
    "category": "Racing",
    "added_at": "2025-12-04T03:45:13.713059Z"
  },
  {
    "url": "https://html5.gamemonetize.com/li3mjjfsponfzv0lrbdraonb6qqf9g4i/",
    "title": "Real Grand Truck Simulator Game",
    "description": "Welcome to the legendary truck parking game. The most realistic and thrilling truck parking simulation game. Are you ready to prove your driving and parking skills with powerful trucks? Get ready for an unforgettable experience where you take control of gigantic trucks and park them in challenging scenarios. Whether you are a parking game enthusiast or a professional truck driver, this game offers something for everyone. Featuring stunning graphics, realistic controls, and immersive sound effects. Legend truck parking will keep you hooked for hours!",
    "thumbnail": "https://img.gamemonetize.com/li3mjjfsponfzv0lrbdraonb6qqf9g4i/512x384.jpg",
    "category": "Adventure",
    "added_at": "2025-12-04T03:45:13.713056Z"
  },
  {
    "url": "https://html5.gamemonetize.com/x18szni3pe1a4863gcud2kqig4rhrgfg/",
    "title": "Food Game Grill Sort",
    "description": "Welcome to Food Game - Grill Sort, the sizzling casual puzzle simulation game that will make your taste buds tingle. Become a master grill chef as you carefully sort and match delicious skewers on the barbecue! Your goal is simple yet addictively fun. Clear food to earn coins according to customers needs.",
    "thumbnail": "https://img.gamemonetize.com/x18szni3pe1a4863gcud2kqig4rhrgfg/512x384.jpg",
    "category": "Puzzles",
    "added_at": "2025-12-04T03:45:13.713046Z"
  },
  {
    "id": "35306",
    "title": "Dinosaur Games For Toddlers",
    "description": "Welcome to Dinosaur Games For Toddlers, a casual collection of minigames on dinosaur themes. Paint a vivid dinosaur in coloring book games, click to see how an egg transforms into chicks, and join a fun car racing game. You can choose chicken types, colors of paintbrushes, or different illustrations freely.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/okteqriu3kq21tj9s55swx4u4o4zg732/",
    "category": "Hypercasual",
    "tags": "Collection, Dinosaur, eggs, Funny",
    "thumb": "https://img.gamemonetize.com/okteqriu3kq21tj9s55swx4u4o4zg732/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "35305",
    "title": "Frank In Geometry Maps",
    "description": "Frank in Geometry Maps is a fast-paced platformer where you control a cube through six intricate mazes. The game throws obstacles like spikes and moving platforms at you while your character speeds along, testing your reflexes. Time your jumps carefully&amp;mdash;use the yellow boosters to reach higher ground and avoid instant-death traps.",
    "instructions": "Touch for jump mouse cllick fo jump",
    "url": "https://html5.gamemonetize.com/8ansls0hjssmsr3rk8ry4clfmwbqq8qn/",
    "category": "Hypercasual",
    "tags": "1 Player, Arcade, Avoid, Geometry, jump",
    "thumb": "https://img.gamemonetize.com/8ansls0hjssmsr3rk8ry4clfmwbqq8qn/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "35304",
    "title": "Timely Delivery",
    "description": "Timely Delivery is a fast and casual delivery runner. Press and hold to move, release to stop - simple controls, tight time constraints. Make your way through crowds and traffic, complete delivery quotas, and collect fees to unlock new skins. With dozens of hand-crafted levels and escalating dangers, every second counts on your way to becoming a delivery star.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cfr12fabbug90fu9aqqqpatan4adauwy/",
    "category": "Arcade",
    "tags": "Avoid, Casual, Obstacle, onetouch, running, Traffic",
    "thumb": "https://img.gamemonetize.com/cfr12fabbug90fu9aqqqpatan4adauwy/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "35303",
    "title": "Monster Truck Zombies&amp;nbsp;Game",
    "description": "Monster Truck Games Kids: Ignite your child&amp;rsquo;s passion for high-octane fun with colossal bigfoot trucks and thrilling monster truck collisions! Watch little racers zoom through dazzling arenas, collect quirky power-ups, and celebrate every smashing victory.",
    "instructions": "W Arrow Up rarr Move Front S Arrow Down rarr Move Back A Arrow Left rarr Move Left D Arrow Right rarr Move Right - To click any button use mouse",
    "url": "https://html5.gamemonetize.com/vx9c332rtjn79s9qjidasv804co4lbwd/",
    "category": "Arcade",
    "tags": "2 Player Games, Adventure, Monster, Race, Zombie",
    "thumb": "https://img.gamemonetize.com/vx9c332rtjn79s9qjidasv804co4lbwd/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35302",
    "title": "Go Mafalda!",
    "description": "Run as Mafalda in this pixelated endless runner! Collect apples to boost your score and dodge slimy slimes to stay alive as long as possible!",
    "instructions": "Spacebar Jump Double Spacebar DOUBLE JUMP ",
    "url": "https://html5.gamemonetize.com/1hsabrp99x1yy9f9vs267k2gt0fvlv0i/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, Cute, endless, Highscore, jump, Pixel, run",
    "thumb": "https://img.gamemonetize.com/1hsabrp99x1yy9f9vs267k2gt0fvlv0i/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "35301",
    "title": "3D Kid Sliding Puzzle",
    "description": "Solve a variety of 3&amp;times;3 and 3&amp;times;4 slide puzzles featuring cute animal drawings by moving one piece at a time into the open space on the puzzle. When all pieces are in the correct position the bottom right corner will be empty and the computer will then fill in that space for you.",
    "instructions": "Use the mouse or tap the screen to solve the puzzle ",
    "url": "https://html5.gamemonetize.com/r9j8tc1hmo3v4q59qbap0e7jhv3m9smc/",
    "category": "Puzzles",
    "tags": "1 Player, Animal, Fun, Funny, Kids, Skill, sliding",
    "thumb": "https://img.gamemonetize.com/r9j8tc1hmo3v4q59qbap0e7jhv3m9smc/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "35300",
    "title": "Power Boat Racing Game",
    "description": "Welcome to the world of power boat games. Get ready for high-speed thrills on the water with PowerBoat Racing, the most realistic and action-packed powerboat simulator game. Take a break from the hustle and dive into the relaxing world of PowerBoat Adventure. Come and enjoy the ocean and realistic cargo motions. The best boat driving simulator comes with the best driving physics!",
    "instructions": "W Arrow Up rarr Move Front S Arrow Down rarr Move Back A Arrow Left rarr Move Left D Arrow Right rarr Move Right - To click any button use mouse",
    "url": "https://html5.gamemonetize.com/m7neml8mldms64runb0a6bhaaro21hhh/",
    "category": "Racing",
    "tags": "Adventure, Boat, Race, Racing, water",
    "thumb": "https://img.gamemonetize.com/m7neml8mldms64runb0a6bhaaro21hhh/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35299",
    "title": "Solitaire: Card Sorting",
    "description": "An intellectual card puzzle that combines the mechanics of classic solitaire with the logic of thematic sorting. At each level, you need to organize cards into categories: plants, jewelry, toys, tools, flowers, and many more. Use observation and strategy to clear the field and complete the level within a limited number of moves.",
    "instructions": "Each round starts with a partially filled table Draw one card from the deck and place it in the correct category To start building place a category card first then add related cards Sort carefully mdash if the layout is wrong you rsquo ll run out ",
    "url": "https://html5.gamemonetize.com/8g0f47j2ywc7mtqftraxeu45z13qw3hg/",
    "category": "Puzzles",
    "tags": "Card, Casual, Puzzle, Solitaire",
    "thumb": "https://img.gamemonetize.com/8g0f47j2ywc7mtqftraxeu45z13qw3hg/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "35298",
    "title": "Jigsolitaire Deluxe",
    "description": "Jigsolitaire Deluxe is a refined card-based puzzle where every level turns into the creation of a masterpiece. Move picture cards around the board to connect them into a seamless image &amp;mdash; from famous paintings like Mona Lisa to serene landscapes and still lifes. As the fragments start to align and the image comes to life, you&amp;rsquo;ll feel that satisfying moment of completion. Simple controls, smooth gameplay, and visually stunning artworks make this game both relaxing and rewarding.",
    "instructions": "Swipe to move cards around the board When two matching pieces align they connect automatically Move connected pieces as a single group Complete all fragments to reveal the full masterpiece The faster you complete the image the higher your score Enj",
    "url": "https://html5.gamemonetize.com/23sgyhikibl5jvylyk2uub6wksiq8tfo/",
    "category": "Puzzles",
    "tags": "1 Player, Card, Relaxation, Solitaire",
    "thumb": "https://img.gamemonetize.com/23sgyhikibl5jvylyk2uub6wksiq8tfo/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "35297",
    "title": "Hen Bubble Go Up Game",
    "description": "Hen Bubble Go Up Game is a fun and simple game where a cute hen flies upward inside a bubble. Your main goal is to help the hen rise safely while avoiding different obstacles. The game is designed with easy controls so every player can enjoy smooth gameplay. Just tap the screen and make the bubble go higher in the sky.",
    "instructions": "- To click any button use mouse",
    "url": "https://html5.gamemonetize.com/zlzf1kffk3viwxaxuw6uhecozdcb85u2/",
    "category": "Hypercasual",
    "tags": "2025 games, Adventure, Arcade, Bubble",
    "thumb": "https://img.gamemonetize.com/zlzf1kffk3viwxaxuw6uhecozdcb85u2/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35296",
    "title": "Aqualogics Puzzles Game",
    "description": "Aqualogics is a challenging and fast-paced water sorting puzzle game designed for sharp minds! Sort all colored liquids into separate tubes using logic, planning, and limited moves. Features: 100 Procedural Levels Clean UI &amp;amp; smooth animations Smart move system Undo, Shuffle &amp;amp; Skip Powers Earn coins and unlock harder levels Mobile-friendly, lightweight HTML5 Are you smart enough to complete all levels? Test your brain now!",
    "instructions": "Tap Click Select a tube Tap another tube to pour Drag Drag from one tube to another to pour mobile amp desktop Undo power Spend coins to undo last move Shuffle power Shuffle liquids when stuck Skip power Skip level costly ",
    "url": "https://html5.gamemonetize.com/myfre67i1rsz9gav2l0in0rfqct6mrjy/",
    "category": "Puzzles",
    "tags": "Brain, Logical, Puzzle",
    "thumb": "https://img.gamemonetize.com/myfre67i1rsz9gav2l0in0rfqct6mrjy/512x384.jpg",
    "width": "900",
    "height": "600"
  }
]