[
  {
    "id": "35306",
    "title": "Dinosaur Games For Toddlers",
    "description": "Welcome to Dinosaur Games For Toddlers, a casual collection of minigames on dinosaur themes. Paint a vivid dinosaur in coloring book games, click to see how an egg transforms into chicks, and join a fun car racing game. You can choose chicken types, colors of paintbrushes, or different illustrations freely.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/okteqriu3kq21tj9s55swx4u4o4zg732/",
    "category": "Hypercasual",
    "tags": "Collection, Dinosaur, eggs, Funny",
    "thumb": "https://img.gamemonetize.com/okteqriu3kq21tj9s55swx4u4o4zg732/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "35305",
    "title": "Frank In Geometry Maps",
    "description": "Frank in Geometry Maps is a fast-paced platformer where you control a cube through six intricate mazes. The game throws obstacles like spikes and moving platforms at you while your character speeds along, testing your reflexes. Time your jumps carefully&amp;mdash;use the yellow boosters to reach higher ground and avoid instant-death traps.",
    "instructions": "Touch for jump mouse cllick fo jump",
    "url": "https://html5.gamemonetize.com/8ansls0hjssmsr3rk8ry4clfmwbqq8qn/",
    "category": "Hypercasual",
    "tags": "1 Player, Arcade, Avoid, Geometry, jump",
    "thumb": "https://img.gamemonetize.com/8ansls0hjssmsr3rk8ry4clfmwbqq8qn/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "35304",
    "title": "Timely Delivery",
    "description": "Timely Delivery is a fast and casual delivery runner. Press and hold to move, release to stop - simple controls, tight time constraints. Make your way through crowds and traffic, complete delivery quotas, and collect fees to unlock new skins. With dozens of hand-crafted levels and escalating dangers, every second counts on your way to becoming a delivery star.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cfr12fabbug90fu9aqqqpatan4adauwy/",
    "category": "Arcade",
    "tags": "Avoid, Casual, Obstacle, onetouch, running, Traffic",
    "thumb": "https://img.gamemonetize.com/cfr12fabbug90fu9aqqqpatan4adauwy/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "35303",
    "title": "Monster Truck Zombies&amp;nbsp;Game",
    "description": "Monster Truck Games Kids: Ignite your child&amp;rsquo;s passion for high-octane fun with colossal bigfoot trucks and thrilling monster truck collisions! Watch little racers zoom through dazzling arenas, collect quirky power-ups, and celebrate every smashing victory.",
    "instructions": "W Arrow Up rarr Move Front S Arrow Down rarr Move Back A Arrow Left rarr Move Left D Arrow Right rarr Move Right - To click any button use mouse",
    "url": "https://html5.gamemonetize.com/vx9c332rtjn79s9qjidasv804co4lbwd/",
    "category": "Arcade",
    "tags": "2 Player Games, Adventure, Monster, Race, Zombie",
    "thumb": "https://img.gamemonetize.com/vx9c332rtjn79s9qjidasv804co4lbwd/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35302",
    "title": "Go Mafalda!",
    "description": "Run as Mafalda in this pixelated endless runner! Collect apples to boost your score and dodge slimy slimes to stay alive as long as possible!",
    "instructions": "Spacebar Jump Double Spacebar DOUBLE JUMP ",
    "url": "https://html5.gamemonetize.com/1hsabrp99x1yy9f9vs267k2gt0fvlv0i/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, Cute, endless, Highscore, jump, Pixel, run",
    "thumb": "https://img.gamemonetize.com/1hsabrp99x1yy9f9vs267k2gt0fvlv0i/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "35301",
    "title": "3D Kid Sliding Puzzle",
    "description": "Solve a variety of 3&amp;times;3 and 3&amp;times;4 slide puzzles featuring cute animal drawings by moving one piece at a time into the open space on the puzzle. When all pieces are in the correct position the bottom right corner will be empty and the computer will then fill in that space for you.",
    "instructions": "Use the mouse or tap the screen to solve the puzzle ",
    "url": "https://html5.gamemonetize.com/r9j8tc1hmo3v4q59qbap0e7jhv3m9smc/",
    "category": "Puzzles",
    "tags": "1 Player, Animal, Fun, Funny, Kids, Skill, sliding",
    "thumb": "https://img.gamemonetize.com/r9j8tc1hmo3v4q59qbap0e7jhv3m9smc/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "35300",
    "title": "Power Boat Racing Game",
    "description": "Welcome to the world of power boat games. Get ready for high-speed thrills on the water with PowerBoat Racing, the most realistic and action-packed powerboat simulator game. Take a break from the hustle and dive into the relaxing world of PowerBoat Adventure. Come and enjoy the ocean and realistic cargo motions. The best boat driving simulator comes with the best driving physics!",
    "instructions": "W Arrow Up rarr Move Front S Arrow Down rarr Move Back A Arrow Left rarr Move Left D Arrow Right rarr Move Right - To click any button use mouse",
    "url": "https://html5.gamemonetize.com/m7neml8mldms64runb0a6bhaaro21hhh/",
    "category": "Racing",
    "tags": "Adventure, Boat, Race, Racing, water",
    "thumb": "https://img.gamemonetize.com/m7neml8mldms64runb0a6bhaaro21hhh/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35299",
    "title": "Solitaire: Card Sorting",
    "description": "An intellectual card puzzle that combines the mechanics of classic solitaire with the logic of thematic sorting. At each level, you need to organize cards into categories: plants, jewelry, toys, tools, flowers, and many more. Use observation and strategy to clear the field and complete the level within a limited number of moves.",
    "instructions": "Each round starts with a partially filled table Draw one card from the deck and place it in the correct category To start building place a category card first then add related cards Sort carefully mdash if the layout is wrong you rsquo ll run out ",
    "url": "https://html5.gamemonetize.com/8g0f47j2ywc7mtqftraxeu45z13qw3hg/",
    "category": "Puzzles",
    "tags": "Card, Casual, Puzzle, Solitaire",
    "thumb": "https://img.gamemonetize.com/8g0f47j2ywc7mtqftraxeu45z13qw3hg/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "35298",
    "title": "Jigsolitaire Deluxe",
    "description": "Jigsolitaire Deluxe is a refined card-based puzzle where every level turns into the creation of a masterpiece. Move picture cards around the board to connect them into a seamless image &amp;mdash; from famous paintings like Mona Lisa to serene landscapes and still lifes. As the fragments start to align and the image comes to life, you&amp;rsquo;ll feel that satisfying moment of completion. Simple controls, smooth gameplay, and visually stunning artworks make this game both relaxing and rewarding.",
    "instructions": "Swipe to move cards around the board When two matching pieces align they connect automatically Move connected pieces as a single group Complete all fragments to reveal the full masterpiece The faster you complete the image the higher your score Enj",
    "url": "https://html5.gamemonetize.com/23sgyhikibl5jvylyk2uub6wksiq8tfo/",
    "category": "Puzzles",
    "tags": "1 Player, Card, Relaxation, Solitaire",
    "thumb": "https://img.gamemonetize.com/23sgyhikibl5jvylyk2uub6wksiq8tfo/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "35297",
    "title": "Hen Bubble Go Up Game",
    "description": "Hen Bubble Go Up Game is a fun and simple game where a cute hen flies upward inside a bubble. Your main goal is to help the hen rise safely while avoiding different obstacles. The game is designed with easy controls so every player can enjoy smooth gameplay. Just tap the screen and make the bubble go higher in the sky.",
    "instructions": "- To click any button use mouse",
    "url": "https://html5.gamemonetize.com/zlzf1kffk3viwxaxuw6uhecozdcb85u2/",
    "category": "Hypercasual",
    "tags": "2025 games, Adventure, Arcade, Bubble",
    "thumb": "https://img.gamemonetize.com/zlzf1kffk3viwxaxuw6uhecozdcb85u2/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35296",
    "title": "Aqualogics Puzzles Game",
    "description": "Aqualogics is a challenging and fast-paced water sorting puzzle game designed for sharp minds! Sort all colored liquids into separate tubes using logic, planning, and limited moves. Features: 100 Procedural Levels Clean UI &amp;amp; smooth animations Smart move system Undo, Shuffle &amp;amp; Skip Powers Earn coins and unlock harder levels Mobile-friendly, lightweight HTML5 Are you smart enough to complete all levels? Test your brain now!",
    "instructions": "Tap Click Select a tube Tap another tube to pour Drag Drag from one tube to another to pour mobile amp desktop Undo power Spend coins to undo last move Shuffle power Shuffle liquids when stuck Skip power Skip level costly ",
    "url": "https://html5.gamemonetize.com/myfre67i1rsz9gav2l0in0rfqct6mrjy/",
    "category": "Puzzles",
    "tags": "Brain, Logical, Puzzle",
    "thumb": "https://img.gamemonetize.com/myfre67i1rsz9gav2l0in0rfqct6mrjy/512x384.jpg",
    "width": "900",
    "height": "600"
  }
]