[
  {
    "id": "35293",
    "title": "Spider Match",
    "description": "Unleash your inner hero and become the legend you were destined to be. Prepare for an epic adventure in a Spiderman world where only the strongest heroes thrive. Collect powerful superheroes, build your legendary team, and venture across vast fantasy worlds in a hero crafted for those who seek glory.",
    "instructions": "Use the mouse or touch to play",
    "url": "https://html5.gamemonetize.com/sjghavwkh9bpg0i06sgsnve9uxomk6x2/",
    "category": "Puzzles",
    "tags": "free html5 games for your website, Kiz 10, Match 3, Puzzle, Spiderman, Superhero",
    "thumb": "https://img.gamemonetize.com/sjghavwkh9bpg0i06sgsnve9uxomk6x2/512x384.jpg",
    "width": "480",
    "height": "800"
  },
  {
    "id": "35292",
    "title": "Gang Blast",
    "description": "Gang Blast is a cover-based escort shooter. Escape from out-of-control dinosaur hordes, protect your evacuation, and clear your way to freedom. Use cash to unlock powerful weapons and perks, and plan every escape route to outwit the guards. One mistake could jeopardize the entire rescue - can you escort everyone to safety?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/48v0gscii4bf868ymoyqf6oyo0tsd2ou/",
    "category": "Shooting",
    "tags": "3D, Dinosaur, Shooter, Stealth, weapons",
    "thumb": "https://img.gamemonetize.com/48v0gscii4bf868ymoyqf6oyo0tsd2ou/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "35291",
    "title": "Legend Dream Football Game",
    "description": "Get ready to dive into the electrifying world of football. Step into the thrilling world of football with the football champions game. Ultimate soccer game, the ultimate sports experience for fans of the beautiful football game. Whether you&amp;rsquo;re a casual gamer or a hardcore football enthusiast, this game delivers realistic gameplay, immersive graphics, and strategic challenges that will keep you hooked for hours. Choose your favorite team and compete in intense matches where every pass, dribble, and goal matters in a football game.",
    "instructions": "W Arrow Up rarr Move Front S Arrow Down rarr Move Back A Arrow Left rarr Move Left D Arrow Right rarr Move Right - To click any button use mouse Pass F Key Shoot Left Shift for power shots Tackle Left Ctrl for defensive nbsp actions",
    "url": "https://html5.gamemonetize.com/bom17v0dxydcmce4incq85b80hxccsqx/",
    "category": "Sports",
    "tags": "2025 games, Action, Ball, Food, Sports",
    "thumb": "https://img.gamemonetize.com/bom17v0dxydcmce4incq85b80hxccsqx/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35290",
    "title": "Toy Rumble 3D",
    "description": "Begin an explosive toy adventure in Toy Rumble 3D. A 3D running and racing arcade game packed with action, speed, and strategy. Move your tank through chaotic obstacle courses, collect parts, assemble your cannon, and shoot your way to victory.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/0a9w8rhj93oivc5ax2ag9khog6k9klar/",
    "category": "Arcade",
    "tags": "Action, Racing, running, Strategy",
    "thumb": "https://img.gamemonetize.com/0a9w8rhj93oivc5ax2ag9khog6k9klar/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "35289",
    "title": "Obby Universe: Mini Games Online",
    "description": "Obby Universe: Mini Games Online A world of incredible adventures! Play: Escape lava waves and outsmart evil traps in unique mini-games. Explore: Find secrets and enjoy parachute jumps or water slides. Build: Construct your own city and even design your personal house to earn bonuses. Customize: Choose from 150+ items for your character and adopt a cool pet. Join the fun now!",
    "instructions": "On PC 1 WASD - move 2 Hold right mouse button - control camera 3 Spacebar - jump On phone 1 Left joystick - walk 2 Press and drag finger on right part of screen - control camera 3 Jump button on right - jump",
    "url": "https://html5.gamemonetize.com/rigii51flinmiis7djlyliiwf3ggc9r1/",
    "category": "Arcade",
    "tags": "3D Games, Adventure, Arcade, Baby Games, Best, Best Games, Brainrot, Cartoon, Casual, House, Kids, Minecraft, roblox, World",
    "thumb": "https://img.gamemonetize.com/rigii51flinmiis7djlyliiwf3ggc9r1/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35288",
    "title": "Puzzle Legends: Game of Heroes",
    "description": "Dive into the colorful world of Puzzle Legends, the ultimate match-3 puzzle game where strategy, skill, and quick thinking collide! Swap, match, and crush gems to solve challenging puzzles while unlocking legendary heroes, powerful boosts, and epic rewards. Join millions of players worldwide in this addictive puzzle adventure. Complete levels filled with tricky obstacles, special gems, and unique power-ups that make every match exciting. Whether you&amp;rsquo;re a casual gamer or a puzzle master, Puzzle Legends offers endless fun with hundreds of levels, daily challenges, and exciting events.",
    "instructions": "Get ready to become a hero in the colorful world of Puzzle Legends the ultimate match-3 puzzle game Follow these simple steps to master the game and climb the leaderboard ",
    "url": "https://html5.gamemonetize.com/m8n8ghtemiogm3qr1wu4x7udws58b84n/",
    "category": "Puzzles",
    "tags": "Match 3, Match-3, Match3",
    "thumb": "https://img.gamemonetize.com/m8n8ghtemiogm3qr1wu4x7udws58b84n/512x384.jpg",
    "width": "430",
    "height": "878"
  },
  {
    "id": "35287",
    "title": "ASMR Relaxing Puzzle Games",
    "description": "Relax with Antistress relaxing toy games by playing A fidget toys 3D Spinner, or just Smash Some Phones to relieve stress, or you can also pop bubbles with a bubble wrap to relax Your mind with antistress puzzle toys game offline &amp;amp; stress relief games for anxiety relief games. We have provided you with antistress relaxing toy games.These games also includepop it fidget antistress gamestress relief games and help you to clean up stress. Take pleasure in enjoying Antistress puzzle toys gamewith tons of fidget games that you can hold, squeeze, crush, or do whatever you want with slime games, it is one of the Pop it Fidget.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/x8n96yantm6dnnqq98nud7qlvhu180dz/",
    "category": "Arcade",
    "tags": "2025 games, 2D, Adventure, Arcade, Best Games, Brainrot",
    "thumb": "https://img.gamemonetize.com/x8n96yantm6dnnqq98nud7qlvhu180dz/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35286",
    "title": "Health Protection",
    "description": "Health Protection is a survival journey inside the body, where you play the role of a brave beneficial bacteria warrior, standing up to protect health from harmful bacteria waves invading. Initially, you are weak and can only eliminate small bacteria to accumulate energy and grow. Over time, your strength increases, allowing you to confront larger and more dangerous bacteria. Each battle is a challenge of observation and target selection, because attacking the wrong opponent can cause you to be overwhelmed immediately. Develop in the right direction, choose the right timing, and clear all threats to protect the body. With engaging growth g",
    "instructions": "Use ASWD to move ",
    "url": "https://html5.gamemonetize.com/j5ksbudef7eir5mwrj6mdric2lq1h7c7/",
    "category": "Hypercasual",
    "tags": "1 Player, Casual, Fight, Fighting",
    "thumb": "https://img.gamemonetize.com/j5ksbudef7eir5mwrj6mdric2lq1h7c7/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "35285",
    "title": "Animal Bus Traffic Jam",
    "description": "All aboard for the cutest puzzle ride ever in Animal Bus Traffic Jam. This clever match-3 sort puzzle and casual logic game challenges you to help adorable animal passengers find their correct buses. Each level is a traffic jam of colorful buses filled with cats, dogs, pandas, and more.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/srinp50qip55glw9w2efsi4phsioa5qu/",
    "category": "Puzzles",
    "tags": "bus, Hypercasual, Match 3, Traffic",
    "thumb": "https://img.gamemonetize.com/srinp50qip55glw9w2efsi4phsioa5qu/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "35284",
    "title": "Dino Idle Park",
    "description": "Dino Idle Park is a relaxing leisure real estate tycoon where you create and develop a dinosaur amusement park. Expand plots, release and display dinosaurs, optimize queues and parks, hire staff, and upgrade investments to increase funds and income. Balance safety, visitor happiness, and research to keep the park thriving even when youre away.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/gurifvt11u531slx3g2euizginnvaag0/",
    "category": "Hypercasual",
    "tags": "3D, Dinosaur, idle, Island, Management, Simulation",
    "thumb": "https://img.gamemonetize.com/gurifvt11u531slx3g2euizginnvaag0/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "35283",
    "title": "Labubu Antistress Game",
    "description": "Labubu Antistress Game is an amazing and free to play online game for kids. play around with our lovely Labubu doll and have fun!",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/ko1brbmzswyng2twamjyngif346vfm18/",
    "category": "Puzzles",
    "tags": "Fun, HTML5, Hypercasual, Kids, Labubu, Mobile, Physics",
    "thumb": "https://img.gamemonetize.com/ko1brbmzswyng2twamjyngif346vfm18/512x384.jpg",
    "width": "480",
    "height": "854"
  }
]